OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f66j94.h
#define _RPO20R0                0x01
#define _RPO20R1                0x02
#define _RPO20R2                0x04
#define _RPO20R3                0x08
#define _RPO21R0                0x10
#define _RPO21R1                0x20
#define _RPO21R2                0x40
#define _RPO21R3                0x80

//==============================================================================


//==============================================================================
//        RPOR22_23 Bits

extern __at(0x0E1D) __sfr RPOR22_23;

typedef union
  {
  struct
    {
    unsigned RPO22R0            : 1;
    unsigned RPO22R1            : 1;
    unsigned RPO22R2            : 1;
    unsigned RPO22R3            : 1;
    unsigned RPO23R0            : 1;
    unsigned RPO23R1            : 1;
    unsigned RPO23R2            : 1;
    unsigned RPO23R3            : 1;
    };

  struct
    {
    unsigned RPO22R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO23R             : 4;
    };
  } __RPOR22_23bits_t;

extern __at(0x0E1D) volatile __RPOR22_23bits_t RPOR22_23bits;

#define _RPO22R0                0x01
#define _RPO22R1                0x02
#define _RPO22R2                0x04
#define _RPO22R3                0x08
#define _RPO23R0                0x10
#define _RPO23R1                0x20
#define _RPO23R2                0x40
#define _RPO23R3                0x80

//==============================================================================


//==============================================================================
//        RPOR24_25 Bits

extern __at(0x0E1E) __sfr RPOR24_25;

typedef union
  {
  struct
    {
    unsigned RPO24R0            : 1;
    unsigned RPO24R1            : 1;
    unsigned RPO24R2            : 1;
    unsigned RPO24R3            : 1;
    unsigned RPO25R0            : 1;
    unsigned RPO25R1            : 1;
    unsigned RPO25R2            : 1;
    unsigned RPO25R3            : 1;
    };

  struct
    {
    unsigned RPO24R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO25R             : 4;
    };
  } __RPOR24_25bits_t;

extern __at(0x0E1E) volatile __RPOR24_25bits_t RPOR24_25bits;

#define _RPO24R0                0x01
#define _RPO24R1                0x02
#define _RPO24R2                0x04
#define _RPO24R3                0x08
#define _RPO25R0                0x10
#define _RPO25R1                0x20
#define _RPO25R2                0x40
#define _RPO25R3                0x80

//==============================================================================


//==============================================================================
//        RPOR26_27 Bits

extern __at(0x0E1F) __sfr RPOR26_27;

typedef union
  {
  struct
    {
    unsigned RPO26R0            : 1;
    unsigned RPO26R1            : 1;
    unsigned RPO26R2            : 1;
    unsigned RPO26R3            : 1;
    unsigned RPO27R0            : 1;
    unsigned RPO27R1            : 1;
    unsigned RPO27R2            : 1;
    unsigned RPO27R3            : 1;
    };

  struct
    {
    unsigned RPO26R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO27R             : 4;
    };
  } __RPOR26_27bits_t;

extern __at(0x0E1F) volatile __RPOR26_27bits_t RPOR26_27bits;

#define _RPO26R0                0x01
#define _RPO26R1                0x02
#define _RPO26R2                0x04
#define _RPO26R3                0x08
#define _RPO27R0                0x10
#define _RPO27R1                0x20
#define _RPO27R2                0x40
#define _RPO27R3                0x80

//==============================================================================


//==============================================================================
//        RPOR28_29 Bits

extern __at(0x0E20) __sfr RPOR28_29;

typedef union
  {
  struct
    {
    unsigned RPO28R0            : 1;
    unsigned RPO28R1            : 1;
    unsigned RPO28R2            : 1;
    unsigned RPO28R3            : 1;
    unsigned RPO29R0            : 1;
    unsigned RPO29R1            : 1;
    unsigned RPO29R2            : 1;
    unsigned RPO29R3            : 1;
    };

  struct
    {
    unsigned RPO28R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO29R             : 4;
    };
  } __RPOR28_29bits_t;

extern __at(0x0E20) volatile __RPOR28_29bits_t RPOR28_29bits;

#define _RPO28R0                0x01
#define _RPO28R1                0x02
#define _RPO28R2                0x04
#define _RPO28R3                0x08
#define _RPO29R0                0x10
#define _RPO29R1                0x20
#define _RPO29R2                0x40
#define _RPO29R3                0x80

//==============================================================================


//==============================================================================
//        RPOR30_31 Bits

extern __at(0x0E21) __sfr RPOR30_31;

typedef union
  {
  struct
    {
    unsigned RPO30R0            : 1;
    unsigned RPO30R1            : 1;
    unsigned RPO30R2            : 1;
    unsigned RPO30R3            : 1;
    unsigned RPO31R0            : 1;
    unsigned RPO31R1            : 1;
    unsigned RPO31R2            : 1;
    unsigned RPO31R3            : 1;
    };

  struct
    {
    unsigned RPO30R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO31R             : 4;
    };
  } __RPOR30_31bits_t;

extern __at(0x0E21) volatile __RPOR30_31bits_t RPOR30_31bits;

#define _RPO30R0                0x01
#define _RPO30R1                0x02
#define _RPO30R2                0x04
#define _RPO30R3                0x08
#define _RPO31R0                0x10
#define _RPO31R1                0x20
#define _RPO31R2                0x40
#define _RPO31R3                0x80

//==============================================================================


//==============================================================================
//        RPOR32_33 Bits

extern __at(0x0E22) __sfr RPOR32_33;

typedef union
  {
  struct
    {
    unsigned RPO32R0            : 1;
    unsigned RPO32R1            : 1;
    unsigned RPO32R2            : 1;
    unsigned RPO32R3            : 1;
    unsigned RPO33R0            : 1;
    unsigned RPO33R1            : 1;
    unsigned RPO33R2            : 1;
    unsigned RPO33R3            : 1;
    };

  struct
    {
    unsigned RPO32R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO33R             : 4;
    };
  } __RPOR32_33bits_t;

extern __at(0x0E22) volatile __RPOR32_33bits_t RPOR32_33bits;

#define _RPO32R0                0x01
#define _RPO32R1                0x02
#define _RPO32R2                0x04
#define _RPO32R3                0x08
#define _RPO33R0                0x10
#define _RPO33R1                0x20
#define _RPO33R2                0x40
#define _RPO33R3                0x80

//==============================================================================


//==============================================================================
//        RPOR34_35 Bits

extern __at(0x0E23) __sfr RPOR34_35;

typedef union
  {
  struct
    {
    unsigned RPO34R0            : 1;
    unsigned RPO34R1            : 1;
    unsigned RPO34R2            : 1;
    unsigned RPO34R3            : 1;
    unsigned RPO35R0            : 1;
    unsigned RPO35R1            : 1;
    unsigned RPO35R2            : 1;
    unsigned RPO35R3            : 1;
    };

  struct
    {
    unsigned RPO34R             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned RPO35R             : 4;
    };
  } __RPOR34_35bits_t;

extern __at(0x0E23) volatile __RPOR34_35bits_t RPOR34_35bits;

