OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f66j94.h
extern __at(0x0ED3) volatile __LCDSE5bits_t LCDSE5bits;

#define _SE40                   0x01
#define _SE41                   0x02
#define _SE42                   0x04
#define _SE43                   0x08
#define _SE44                   0x10
#define _SE45                   0x20
#define _SE46                   0x40
#define _SE47                   0x80

//==============================================================================


//==============================================================================
//        LCDSE6 Bits

extern __at(0x0ED4) __sfr LCDSE6;

typedef struct
  {
  unsigned SE48                 : 1;
  unsigned SE49                 : 1;
  unsigned SE50                 : 1;
  unsigned SE51                 : 1;
  unsigned SE52                 : 1;
  unsigned SE53                 : 1;
  unsigned SE54                 : 1;
  unsigned SE55                 : 1;
  } __LCDSE6bits_t;

extern __at(0x0ED4) volatile __LCDSE6bits_t LCDSE6bits;

#define _SE48                   0x01
#define _SE49                   0x02
#define _SE50                   0x04
#define _SE51                   0x08
#define _SE52                   0x10
#define _SE53                   0x20
#define _SE54                   0x40
#define _SE55                   0x80

//==============================================================================


//==============================================================================
//        LCDSE7 Bits

extern __at(0x0ED5) __sfr LCDSE7;

typedef struct
  {
  unsigned SE56                 : 1;
  unsigned SE57                 : 1;
  unsigned SE58                 : 1;
  unsigned SE59                 : 1;
  unsigned SE60                 : 1;
  unsigned SE61                 : 1;
  unsigned SE62                 : 1;
  unsigned SE63                 : 1;
  } __LCDSE7bits_t;

extern __at(0x0ED5) volatile __LCDSE7bits_t LCDSE7bits;

#define _SE56                   0x01
#define _SE57                   0x02
#define _SE58                   0x04
#define _SE59                   0x08
#define _SE60                   0x10
#define _SE61                   0x20
#define _SE62                   0x40
#define _SE63                   0x80

//==============================================================================


//==============================================================================
//        LCDRL Bits

extern __at(0x0ED6) __sfr LCDRL;

typedef union
  {
  struct
    {
    unsigned LRLAT0             : 1;
    unsigned LRLAT1             : 1;
    unsigned LRLAT2             : 1;
    unsigned                    : 1;
    unsigned LRLBP0             : 1;
    unsigned LRLBP1             : 1;
    unsigned LRLAP0             : 1;
    unsigned LRLAP1             : 1;
    };

  struct
    {
    unsigned LRLAT              : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 4;
    unsigned LRLBP              : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned LRLAP              : 2;
    };
  } __LCDRLbits_t;

extern __at(0x0ED6) volatile __LCDRLbits_t LCDRLbits;

#define _LRLAT0                 0x01
#define _LRLAT1                 0x02
#define _LRLAT2                 0x04
#define _LRLBP0                 0x10
#define _LRLBP1                 0x20
#define _LRLAP0                 0x40
#define _LRLAP1                 0x80

//==============================================================================


//==============================================================================
//        LCDREF Bits

extern __at(0x0ED7) __sfr LCDREF;

typedef union
  {
  struct
    {
    unsigned VLCD1PE            : 1;
    unsigned VLCD2PE            : 1;
    unsigned VLCD3PE            : 1;
    unsigned LCDCST0            : 1;
    unsigned LCDCST1            : 1;
    unsigned LCDCST2            : 1;
    unsigned                    : 1;
    unsigned LCDIRE             : 1;
    };

  struct
    {
    unsigned                    : 3;
    unsigned LCDCST             : 3;
    unsigned                    : 2;
    };
  } __LCDREFbits_t;

extern __at(0x0ED7) volatile __LCDREFbits_t LCDREFbits;

#define _VLCD1PE                0x01
#define _VLCD2PE                0x02
#define _VLCD3PE                0x04
#define _LCDCST0                0x08
#define _LCDCST1                0x10
#define _LCDCST2                0x20
#define _LCDIRE                 0x80

//==============================================================================


//==============================================================================
//        LCDREG Bits

extern __at(0x0ED8) __sfr LCDREG;

typedef union
  {
  struct
    {
    unsigned CLKSEL0            : 1;
    unsigned CLKSEL1            : 1;
    unsigned MODE13             : 1;
    unsigned BIAS0              : 1;
    unsigned BIAS1              : 1;
    unsigned BIAS2              : 1;
    unsigned                    : 1;
    unsigned CPEN               : 1;
    };

  struct
    {
    unsigned CLKSEL             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned BIAS               : 3;
    unsigned                    : 2;
    };
  } __LCDREGbits_t;

extern __at(0x0ED8) volatile __LCDREGbits_t LCDREGbits;

#define _CLKSEL0                0x01
#define _CLKSEL1                0x02
#define _MODE13                 0x04
#define _BIAS0                  0x08
#define _BIAS1                  0x10
#define _BIAS2                  0x20
#define _CPEN                   0x80

//==============================================================================


//==============================================================================
//        LCDCON Bits

extern __at(0x0ED9) __sfr LCDCON;

typedef union
  {
  struct
    {
    unsigned LMUX0              : 1;
    unsigned LMUX1              : 1;
    unsigned LMUX2              : 1;
    unsigned CS0                : 1;
    unsigned CS1                : 1;
    unsigned WERR               : 1;
    unsigned SLPEN              : 1;
    unsigned LCDEN              : 1;
    };

  struct
    {
    unsigned LMUX               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 3;
    unsigned CS                 : 2;
    unsigned                    : 3;
    };
  } __LCDCONbits_t;

